app/Controllers/Admin/Courses.php

SELECT `c`.`id`, `c`.`course`, `c`.`description`, `c`.`created_at`, `u`.`name` as `teacher_name`, `u`.`id` as `teacher_id`
FROM `courses` `c`
LEFT JOIN `users` `u` ON `u`.`id` = `c`.`teacher_id`
ORDER BY `c`.`created_at` DESC
---
    public function index()
    {
        // Admin only
        $this->requireRole('admin');

        $db = \Config\Database::connect();
        $courses = $db->table('courses c')
            ->select('c.id, c.course, c.description, c.created_at, u.name as teacher_name, u.id as teacher_id')
            ->join('users u', 'u.id = c.teacher_id', 'left')
            ->orderBy('c.created_at', 'DESC')
            ->get()
            ->getResultArray();