app/Controllers/Admin/Users.php

    public function index()
    {
        $this->requireRole('admin');

        $db = \Config\Database::connect();
        $users = $db->table('users')
            ->select('id, name, email, role, is_active, created_at')
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`, `email`, `role`, `is_active`, `created_at`
FROM `users`
ORDER BY `created_at` DESC