app/Controllers/Student/Enroll.php

    public function index()
    {
        $this->requireRole('student');

        $userId = $this->userData['id'] ?? 0;

        // Get all available courses with teacher information
        $courses = $this->courseModel->select('courses.*, users.name as teacher_name')
            ->join('users', 'users.id = courses.teacher_id')
            ->where('users.is_active', 1)
            ->findAll();
---
SELECT `courses`.*, `users`.`name` as `teacher_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `users`.`is_active` = 1