app/Controllers/Course.php

SELECT *
FROM `courses`
WHERE `course` LIKE '%math%' ESCAPE '!'
OR  `description` LIKE '%math%' ESCAPE '!'
---
    public function search()
    {
        $searchTerm = $this->request->getGet('search_term');

        if ($searchTerm === null) {
            $searchTerm = $this->request->getPost('search_term');
        }

        $courseModel = new CourseModel();

        if (!empty($searchTerm)) {
            $courseModel
                ->like('course', $searchTerm)
                ->orLike('description', $searchTerm);
        }

        $courses = $courseModel->findAll();