app/Controllers/Materials.php

    public function upload($course_id = null)
    {
        // Check if user is logged in and is admin/teacher
        if (!$this->isLoggedIn() || !$this->hasRole(['admin', 'teacher'])) {
            return redirect()->to('/login');
        }

        $course_id = (int) $course_id;

        // Verify course exists
        $course = $this->courseModel->find($course_id);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = 1

    public function courseMaterials($course_id = null)
    {
        // Check if user is logged in
        if (!$this->isLoggedIn()) {
            return redirect()->to('/login');
        }

        $course_id = (int) $course_id;

        // Check if user is enrolled in the course (for students) or is admin/teacher
        if ($this->hasRole('student')) {
            $isEnrolled = $this->enrollmentModel->isAlreadyEnrolled($this->userData['id'], $course_id);
            if (!$isEnrolled) {
                session()->setFlashdata('error', 'You are not enrolled in this course.');
                return redirect()->to('/student/dashboard');
            }
        }

        // Get course info
        $course = $this->courseModel->find($course_id);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = 1