app/Models/EnrollmentModel.php

    public function getUserEnrollments(int $userId): array
    {
        return $this->db->table($this->table)
            ->select('courses.id, courses.title, courses.description, enrollments.enrolled_at')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->where('enrollments.student_id', $userId)
            ->orderBy('enrollments.enrolled_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `courses`.`id`, `courses`.`course`, `courses`.`description`, `enrollments`.`enrolled_at`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`student_id` = 2
ORDER BY `enrollments`.`enrolled_at` DESC

    public function isAlreadyEnrolled(int $userId, int $courseId): bool
    {
        return (bool) $this->where([
            'student_id' => $userId,
            'course_id'  => $courseId,
        ])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `student_id` = 2
AND `course_id` = 1