app/Models/MaterialModel.php

SELECT *
FROM `materials`
WHERE `course_id` = 1
ORDER BY `created_at` DESC
---
    public function getMaterialsByCourse($course_id)
    {
        return $this->where('course_id', $course_id)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();